{
    "tsn": [ 
	"Atascadero",
	"Agamemnon",
	"Achilles",
	"Ankara",
	"Aleppo", 
	"Bismark",
	"Bellephoron",
	"Buffalo",
	"Busan",
	"Beijing", 
	"Cheremkova",
	"Chengdu",
	"Chennai",
	"Cerebus",
	"Chicago", 
	"Dauntless",
	"Delhi",
	"Dhaka",
	"Damascus",
	"Decatur", 
	"Essex",
	"Eclipse",
	"Erebus",
	"Erzurum",
	"Exeter",
	"Frankfurt",
	"Farragut",
	"Fletcher",
	"Franklin",
	"Fuyutsuki",
	"Gibraltar",
	"Greyhound",
	"Garibaldi",
	"Guangzhou",
	"Griffon",
	"Hood",
	"Hyderabad",
	"Hamakaze",
	"Hannibal",
	"Hamilton",
	"Idaho",
	"Imperator",
	"Invincible",
	"Icarus",
	"Izumo",
	"Jamestown",
	"Jarvis",
	"Javelin",
	"Jupiter",
	"Juarez",
	"Kurita",
	"Kumano",
	"Kandahar",
	"Kirov",
	"Kortenaer",
	"Lanzhou",
	"Lexington",
	"Larkspur",
	"Leipzig",
	"Lincoln",
	"Murmansk",
	"Musashi",
	"Memphis",
	"Mumbai",
	"Melbourne",
	"Niagara",
	"Novosibirsk",
	"Nanjing",
	"Nelson",
	"Nevada",
	"Odin",
	"Odessa",
	"Olympus",
	"Osiris",
	"Osaka",
	"Pegasus",
	"Pretoria",
	"Phoenix",
	"Prague",
	"Perseus",
	"Qingdao",
	"Quito",
	"Quicksilver",
	"Questor",
	"Qarshi",
	"Riyadh",
	"Resolute",
	"Reykjavik",
	"Ranger",
	"Regulus",
	"Stuttgart",
	"Saratoga",
	"Sagittarius",
	"Seattle",
	"Shimakaze",
	"Ticonderoga",
	"Titan",
	"Tianjin",
	"Tannhauser",
	"Termagant",
	"Ursa",
	"Umikaze",
	"Ulysses",
	"Ulster",
	"Uganda",
	"Valiant",
	"Victory",
	"Vigilant",
	"Valparaiso",
	"Valkyrie",
	"Warsaw",
	"Wisconsin",
	"Warramunga",
	"Wuhan",
	"Wyvern",
	"Xerxes",
	"Xiamen",
	"Xuchang",
	"Xanthus",
	"Xebec",
	"Yanagi",
	"Yukikaze",
	"Yorktown",
	"Yancheng",
	"Yakumo",
	"Zenith",
	"Zetland",
	"Zhengzhou",
	"Zagreb",
	"Zanzibar"
],
    "civilian": [
        "Arlington",
	"Aspen",
	"Albion",
	"Adelaide",
	"Auckland",
        "Birmingham",
	"Brisbane",
	"Barcelona",
	"Belfast",
	"Bukhara",
        "Cleveland",
	"Celeste",
	"Cairo",
	"Casablanca",
	"Coyote",
        "Denmark",
	"Dallas",
	"Dublin",
	"Dresden",
	"Dayton",
        "Elba",
	"Eindhoven",
	"Esperanza",
	"Edsel",
	"Espada",
	"Fairfax",
	"Fancy",
	"Falcon",
	"Flamingo",
	"Fiji",
	"Glasgow",
	"Galatea",
	"Gazelle",
	"Geronimo",
	"Gdansk",
	"Helsinki",
	"Halcyon",
	"Hector",
	"Hiawatha",
	"Hydra",
	"Incheon",
	"Ibex",
	"Itasca",
	"Istanbul",
	"Icarus",
	"Jakarta",
	"Jamaica",
	"Jenkins",
	"Jaguar",
	"Jackal",
	"Kamchatka",
	"Kangaroo",
	"Kansas",
	"Killdeer",
	"Kodiak",
	"Lourdes",
	"Lynx",
	"Lipetsk",
	"Lhasa",
	"Liverpool",
	"Manchester",
	"Maddox",
	"Milwaukee",
	"Marduk",
	"Minerva",
	"Narwhal",
	"Nostromo",
	"Niobe",
	"Nogales",
	"Nairobi",
	"Oslo",
	"Okinawa",
	"Oriole",
	"Osprey",
	"Ozark",
	"Palamino",
	"Percival",
	"Penguin",
	"Pioneer",
	"Panther",
	"Quetzalcoatl",
	"Quartz",
	"Quail",
	"Quetta",
	"Quevedo",
	"Rastanante",
	"Raven",
	"Riga",
	"Redwing",
	"Rotterdam",
	"Sacramento",
	"Sapphire",
	"Saturn",
	"Seneca",
	"Shenzhen",
	"Tacoma",
	"Tahoe",
	"Tiburon",
	"Taurus",
	"Tempest",
	"Utrecht",
	"Uppsala",
	"Unicorn",
	"Umayyad",
	"Umbra",
	"Viceroy",
	"Veracruz",
	"Valencia",
	"Vesuvius",
	"Vladivostok",
	"Wyoming",
	"Walrus",
	"Wichita",
	"Whirlwind",
	"Wildcat",
	"Xanadu",
	"Xenopus",
	"Xenon",
	"Xingtai",
	"Xico",
	"Yakima",
	"Yukon",
	"Yokohama",
	"Yantai",
	"Yeosu",
	"Zebra",
	"Zaragosa",
	"Zaria",
	"Zarqa",
	"Zircon"
],
    "kralien": [
        "Amborax",
        "Azoz Aiyana",
        "Ertanzi Danko",
        "Torten",
	"Trun Yeandoten"
],
    "arvonian": [
        "Ascendent",
        "Brazen Sparrow",
        "Crown of Ravens",
        "Daring Kestrel",
        "Eagle's Claw"
],
    "torgoth": [
        "Angry Storm",
        "Bonebreaker",
        "Crushing Anvil",
        "Dragon Hunter",
        "Enraged Shark"
],
    "skaraan": [
        "Asset Forfeiture",
        "Buyer Beware",
        "Capital Gains",
        "Deep Pockets",
        "Endeavor",
	"Fortunate Sun",
	"Golden Goose",
	"Hidden Asset",
	"Invisible Hand"
],
    "ximni": [
        "Arrogant Anvil",
        "Belligerant Rodent",
        "Crown of Knives",
        "Deadly Silence",
        "Excellent Plumage"
],
    "peacetime": [
        "Azusa",
        "Bakersfield",
        "Calistoga",
        "Dixon",
        "Eureka",
	"Fresno",
	"Gridley",
	"Hollister",
	"Ivanhoe",
	"Jovista",
	"Keswick",
	"Lafayette",
	"Mendocino",
	"Napa",
	"Oxnard",
	"Petaluma",
	"Quincy",
	"Rumsey",
	"Soledad",
	"Turlock",
	"Ukiah",
	"Vallejo",
	"Willets",
	"Xavier",
	"Yolo",
	"Zamora"
],
    "captain": [
        "Ashton Marlin",
        "Barclay Barnes",
        "Clancy Clark",
        "Dash Hardpike",
        "Ernesto Camacho",
	"Flynn Flon",
	"Gordon Grover",
	"Harley Davis",
	"Isabel Brocken",
	"Jessica Usagi",
	"Karson Blanco",
	"Lizbet Dahl",
	"Masahito Inaba",
	"Nikita Kobyakov",
	"Oscar Ortega",
	"Piotr Pavel",
	"Quentin Carlos",
	"Rebecca Raynes",
	"Shannon Simmons",
	"Tracy Sheldon",
	"Ulrich Larson",
	"Vance Edwards",
	"Winston Iglesias",
	"Xander Booth",
	"Yadira Ramos",
	"Zayden Hayes",
	"Spike Mustelney",
	"Rutger Deckerd",
	"Rob Tomertson",
	"Shirley Elle",
	"Tomric Patterson",
	"Warrick Etherington",
	"Barron Dwight",
	"Wally Billis",
	"Rock Paulwell",
	"Gill Phregory"
],
    "tradegoods": [
	"Bipolar Monopoles",
    	"Nontubular Bells",
    	"Albatross Soup",
    	"Pyrite Goldfish",
    	"Corrugated Cabbages",
	"Armor-Piercing Watermelons",
	"Beryllium Spheres",
	"Osmium Dodgeballs",
	"Pickled Eggplants",
	"Moebius Noodles",
	"Cobalt Oranges",
	"Klein Bottles",
	"Mollusk Jerky",
	"Silicon Nanotubes",
	"Dimethyl Bananas",
	"Ambivalent Plums",
	"Noncashew Chicken",
	"Runcible Forks",
	"Gallium Teaspoons",
	"Bauxite Pumpernickel",
	"Schwarzchild Spaghetti",
	"Fungible Tokens",
	"Casimir Plates",
	"Cherenkov Sunglasses",
	"Polycarbonate Aglets",
	"Rhubarb Syrup",
	"Oval Ball Bearings",
	"Untangling Cream",
	"Nonalcoholic Ethanol",
	"Origami Boulders",
	"Blue Canary Nightlites",
	"Nonspiral Notebooks",
	"Bifurcated Infinitives",
	"Kevlar Bikinis",
	"Bowl of Petunias",
	"Tofurkey Turduckens",
	"Albino Alligators",
	"Digital Sundials",
	"Acoustic Bicycles",
	"Carnivorous Tofu",
	"Lanthanide Geese",
	"Cubical Marbles",
	"Marbled Cubicles",
	"Garlic Ice Cream",
	"Hydrophobic Jellyfish",
	"Smectite Pigeons",
	"Bouncy Bubble Beverage",
	"Molybdenum Mittens",
	"Gelatinous Tetrahedrons",
	"Traffic Pylons",
	"Clerical Birdstumps",
	"Residential Waffles"
],
    "clue_list": [
        {"clue": "The captain is allergic to milk. Won't go near anything with dairy.", "container": "Cheddar Milkshake Mix"},
        {"clue": "The captain is allergic to shellfish. Makes them swell up like a Lyran Puffersquid.", "container": "Cerulean Oysters"},
        {"clue": "The captain is allergic to avacados. Gives them a horrible full-body rash.", "container": "10W-30 Avacado Oil"},
        {"clue": "The captain is allergic to peanuts. Ate the wrong candy bar once, put them in a coma.", "container": "Peanut Butter Toothpaste"},
        {"clue": "The captain is allergic to zuniki fruit. Horrible bloating, purple skin, the works.", "container": "Zuniki Juice Popsicles"},
        {"clue": "The captain is allergic to tedoni fruit. Severe nausea, projectile vomiting.", "container": "Tedoni Bubble Tea"},
        {"clue": "The captain is allergic to tomatoes. Throat swelled up, almost suffocated.", "container": "Carbonated Ketchup"},
        {"clue": "The captain is allergic to chocolate. Lips swell up, gives them the squirts.", "container": "Emotional Support Fudgepops"},
        {"clue": "The captain is allergic to pineapple. Can't stand anything with it.", "container": "Toasted Pineapple Mayonnaise"},
        {"clue": "The captain is a vegetarian. Very militant about it, won't eat anything with a face.", "container": "Tactical Spec Bacon"},
        {"clue": "The captain hates Torgoths. Xenophobic squidfaces wiped out their home colony.", "container": "Torgoth Assault Pianos"},
        {"clue": "The captain hates Arvonians. Lost their last ship in a crooked Mala-Mala game.", "container": "Arvonian Pleated Battleskirts"},
        {"clue": "The captain hates Kraliens. Lost two siblings against an Inquisitor attack.", "container": "Kralien Communion Pellets"},
        {"clue": "The captain hates Skaraans. Combine grocery thugs bio-bombed their family farm.", "container": "Skaraan Blockchain Broccoli"},
        {"clue": "The captain hates the Ximni. Destroyed their ship, left them for dead.", "container": "Ximni Corpseflower Brandy"},
        {"clue": "The ship's license to carry livestock expired six months ago.", "container": "Laparian Racing Mules"},
        {"clue": "The ship isn't authorized to carry explosive fruit.", "container": "Nitroburst Cantaloupes"},
        {"clue": "The refrigerator container was broken, but the deck chief told me not to fix it.", "container": "Frozen Lingonberries"},
        {"clue": "I saw a mechanic replacing an oxygen tank on a lumber container, which was a little odd.", "container": "Bluewood Planks"},
        {"clue": "I heard tapping noises in the turnip container, but the deck chief told me not to go near it.", "container": "Glazed Turnips"},
	{"clue": "The captain was discharged from the TSN and is still bitter about it. ", "container": "Empty"},
	{"clue": "The captain has a pet Laparian muskrat. It sits right next to the captain on the bridge.", "container": "Empty"},
	{"clue": "The captain is an ex-pirate. They are trying to go legit.", "container": "Empty"},
	{"clue": "The captain is a retired veteran. They commanded a battleship at the Sirius Feint.", "container": "Empty"},
	{"clue": "The captain has a drinking problem. If they aren't drinking, then they're going to be a problem.", "container": "Empty"},
	{"clue": "The portside trim thrusters definitely had a vibration problem at higher power cycles.", "container": "Empty"},
	{"clue": "The captain is a retired professional wrestler, the Bellatrix Brawler.", "container": "Empty"},
	{"clue": "The #2 engine was leaking coolant like a Torgoth showerhead.", "container": "Empty"},
	{"clue": "The hull had a lot of battle damage. The captain likes to live dangerously.", "container": "Empty"},
	{"clue": "Doesn't look like much on the outside, but under the cover-panels, everything was sparkling clean.", "container": "Empty"},
	{"clue": "The power modulators and infusion couplers have been upgraded for extra speed.", "container": "Empty"},
	{"clue": "The captain collects snowglobes. Had a couple hundred or so in their cabin.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Foreign Object.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Rusty Bucket.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Rubber Ducky.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Extra Nostril.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Elbow Grease.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Squeaky Wheel.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Rusty Bucket.", "container": "Empty"},
	{"clue": "The captain's nickname in high school was Knuckle Sandwich.", "container": "Empty"}
],
    "complaints": [
	"I really hate to bother you but... could you possibly ask the captain if there are any other passenger suites available? Maybe something a little further from the engine room? Unfortunately, this one is right next to a bulkhead, and I'm very sensitive to certain vibrations. If there aren't any other suites available, perhaps you could ask the Chief Engineer to recalibrate the intertial dampeners?",
	"Could you please let the Captain know that there appears to be some problem with the galley? I keep paging room service, but nobody is answering!",
	"I'm not sure if this is really a serious problem, but there really is this horrible smell coming out of one of the vents in my quarters. Burning plastic or ozone or something, but it's really very strong. Could you send an engineering team to my quarters and see if they can get rid of the smell?",
	"This is a very minor issue, I mean, not something you should bother the Captain with, but if it's not too much trouble, the drain for the sink in my bathroom isn't draining properly. I mean, it's a little slow... like, clogged a little bit but not all the way. Could you let maintenance know about it?",
	"Are there any decent dry cleaners on this ship? I tried asking the Supply Officer, but he was very rude to me! Could you please let the Captain know so a reprimand or something could be issued?",
	"I need more pillows. I tried asking the Supply Officer for more pillows, but he said there's something about a Navy regulation that you can't have more than two pillows per bed? But I am clearly not a Navy service-person! He gave me this DD Form 1348, but I have no idea how to fill this out. What is a DODAAC? Why do I need one to get more pillows? Can you just tell the captain to send somebody with more pillows?",
	"The lights in my quarters are too bright, and the dimmer control isn't working. At least I think it's the dimmer control? None of the environmental controls are labeled, which is very confusing. I would think on a Navy ship there would be some sort of regulation about that? Next time I talk to the Fleet Admiral, I'm definitely going to mention that. But the lights are still too bright, and I get migraines. So could you send maybe a maintenance crew to replace the lights, or just dim them a little?",
	"Ok, well, this is new... the lights in my quarters are now flickering, and I really, really do not want to get a migraine now. I don't want to make a fuss about this, but I've been told that I can be really, really unpleasant when I get a migraine. I guess I could turn the lights off, but that sort of defeats the whole purpose of having lights, doesn't it? Could you send maintenance down to look at the lights as soon as possible?",
	"Well, I'm not sure if this is important, but if you remember I mentioned the thing about vibrations earlier, so I was moving the bed away from the bulkhead, and I noticed there was a stain on the wall behind the bed. At first I thought it was blood, which would be really weird, because why would a bulkhead be bleeding, but I looked closer, and it was still wet, so I think maybe it was rust? Is that normal? I mean, a bulkhead rusting. Is that something that could be dangerous? Could you send someone from engineering up to take a look at this?",
	"There's a hissing noise coming from the vent in my quarters. Which I guess could be normal, because it's a vent, so maybe it's supposed to be doing that? But I think it's getting louder. I guess it's maybe not something I should bother maintenance with, but if they're not really busy, maybe could you send someone to check the vent?",
	"I know you're probably busy, but this is really somewhat urgent. I could really use more towels. Quite a few more towels. Also, this isn't really related, but the shower in my suite keeps overflowing. I guess that's really a separate request. But if you could please send more towels at your earliest possible convenience, I would greatly appreciate that.",
	"The door controls to my quarters appear to be malfunctioning. It won't open. Do I need to remind the Captain that as the Terran Ambassador, I have diplomatic immunity, and any attempt to confine an Ambassador or restrict their free movement while on a diplomatic mission is against the Eridani Treaty of 2214. I do not want to lodge a formal complaint or escalate this into an official incident but -- Wait, the door opened. Never mind.",
	"The door to my quarters keeps sticking. I mean, I can still open or close it, but sometimes it gets stuck, and you really have to shove it to get it to move. I think that's a safety issue? I mean, what if there's an emergency and I can't get out of my quarters. Do I need to report this to a safety officer or is this something that maintenance handles? Maybe it needs some oil or grease?",
	"Would it be possible, if they aren't being used for anything, to power down the ship's shields? I mean, obviously, if we're in combat, leave them up, but if we're not, maybe shut them down for a little bit? I think they might be interfering with my holovid reception.",
	"The temperature in my quarters is too cold. I tried changing the thermostat settings, but I'm not sure the temperature sensors are working correctly, because the thermostat says the temperature is 25 degrees, and there's just no way that can be correct. It certainly doesn't feel like 25 degrees. Maybe the thermostat is broken? Can you send someone from maintenance to check the thermostat?",
	"The temperature in my quarters is too warm. I thought the thermostat was broken, so I turned it up to 30 degrees, but somehow I think it got locked there and now I can't turn it down. Is there a security code or something to unlock the thermostat? Can you adjust the temperature remotely, or do you have to send someone from maintenance to do that?",
	"Hello? Is this intercom working? What deck am I on? I was told there was a gymnasium down this hallway, but all of these doors are locked and my security code isn't working. Also, why would the gymnasium be behind a door with a radiation warning? Why isn't there a directory or map available? Can you give me directions to the gymnasium?",
	"Sorry to bother you, but I have one very small, minor request. If you're not busy with something else, could you please send a roasted brontosquid banquet dinner to my suite? And formal dinnerware and silverware for a party of eight. Oh, and napkins! Don't forget the napkins!",
	"Yes, room service? I'd like to order a Cobb salad, with avacado if you have it. And a bottle of wine. Do you have a wine list? Do you have anything sweet, like a shiraz or zinfandel? Do you have any marshmallows or chocolate? And bread. What kind of bread? Do you have any sourdough or ciabatta? What? I have no idea, I was trying to call room service. Can you transfer me to the galley?",
	"Well, this is going to sound a little odd, but... How do I put this? Ok, let me try it this way. Is there a way that I could request something, but it's not actually a request? Not quite an implied interrogative, but very, very close to that. Do you know what I mean?"
],
    "canadian": [
        "Alberta",
        "Bawlf",
        "Crapaud",
        "Drinkwater",
        "Edmonton",
	"Flin Flon",
	"Goobies",
	"Halifax",
	"Inukjuak",
	"Joggins",
	"Kamloops",
	"Lillooet",
	"Manitoba",
	"Nojack",
	"Ottowa",
	"Pugwash",
	"Quispamsis",
	"Roachvale",
	"Spuzzum",
	"Toronto",
	"Uphill",
	"Vulcan",
	"Woodfibre",
	"Xena",
	"Youbou",
	"Zeballos"
],
    "unknown": [
        "Antelope",
        "Bluebird",
        "Codfish",
        "Dolphin",
        "Egret"
]

}
